import spacy
from spacy.lang.ar import Arabic


nlp=Arabic()
text=nlp("ربما كانت أحد أهم التطورات التي قامت بها الرياضيات العربية التي بدأت في هذا الوقت بعمل الخوارزمي و هي بدايات الجبر، و من المهم فهم كيف كانت هذه الفكرة الجديدة مهمة، فقد كانت خطوة ثورية بعيدا عن المفهوم اليوناني للرياضيات التي هي في جوهرها هندسة، الجبر كان نظرية موحدة تتيح الأعداد الكسرية و الأعداد اللا كسرية، و المقادير الهندسية و غيرها، أن تتعامل على أنها أجسام جبرية، و أعطت الرياضيات ككل مسارا جديدا للتطور بمفهوم أوسع بكثير من الذي كان موجودا من قبل، و قدم وسيلة للتنمية في هذا الموضوع مستقبلا و جانب آخر مهم لإدخال أفكار الجبر و هو أنه سمح بتطبيق الرياضيات على نفسها بطريقة لم تحدث من قبل.")

#sentence tokenization
for s in text.sents:
    print(s)

#word tokenization
for s in text:
    print(s)

#POS TAGGING
for w in text:
    print(w," : ",w.pos_," : ",w.tag_)

#spacy.explain('DT')

#stem and lemm
for w in text:
    print(w.text," : ",w.lemma_)